In [1]:
import numpy as np
import pandas as pd

In [14]:
df=pd.DataFrame({'column 1':[1,1,2,2,3,3],
                'column 2':['a','a','b','b','c','c'],
                'column 3':['A','A','B','B','C','C']})
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C

In [6]:
#it searches each row in DF and returns True if same row is found before
# it finds row wise duplicates
df.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
dtype: bool

In [7]:
# passing that series object into df will display only duplicated data
df[df.duplicated()]

   column 1 column 2 column 3
1         1        a        A
3         2        b        B
5         3        c        C

In [15]:
#this will drop duplicate rows and return it, below op is temperory, we can use inplace to make it permanent
df.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

In [22]:
df=pd.DataFrame({'column 1':[1,1,2,2,3,3,3],
                'column 2':['a','a','b','b','c','c','D'],
                'column 3':['A','A','B','B','C','D','C']})
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        D
6         3        D        C

In [24]:
# drops duplicates in onoy specific column
df.drop_duplicates(['column 2'])

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C
6         3        D        C